{
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert/distilbert-base-uncased-distilled-squad",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 6,
  "lora_dropout": 0.15,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 2,
  "revision": null,
  "target_modules": [
    "q_lin",
    "k_lin",
    "v_lin"
  ],
  "task_type": "QUESTION_ANS"
}