{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "distilbert/distilbert-base-uncased-distilled-squad",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 6,
  "lora_dropout": 0.15,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "qa_outputs"
  ],
  "peft_type": "LORA",
  "r": 4,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_lin",
    "q_lin",
    "ffn.lin1",
    "v_lin",
    "attention.out_proj",
    "ffn.lin2"
  ],
  "task_type": "QUESTION_ANS",
  "use_dora": false,
  "use_rslora": false
}